<!-- add-pr-comment:terraform-plan -->

## Terraform Plan:

<details>
<summary>Click to expand terraform plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # seqera_orgs.test_org will be created
  + resource "seqera_orgs" "test_org" {
      + description = "testing org for the terraform provider"
      + full_name   = "seqera_test_shahbaz_tf_provider"
      + location    = (known after apply)
      + member_id   = (known after apply)
      + member_role = (known after apply)
      + name        = "seqera_test_shahbaz_tf_provider"
      + org_id      = (known after apply)
      + website     = (known after apply)
    }

  # seqera_teams.my_teams will be created
  + resource "seqera_teams" "my_teams" {
      + avatar_url    = (known after apply)
      + description   = "Team created by Terraform"
      + members_count = (known after apply)
      + name          = "terraform-test-team"
      + org_id        = (known after apply)
      + team_id       = (known after apply)
    }

  # seqera_workspace.my_workspace will be created
  + resource "seqera_workspace" "my_workspace" {
      + date_created = (known after apply)
      + description  = "A test workspace created with Terraform"
      + full_name    = "Test Workspace for Terraform Provider"
      + id           = (known after apply)
      + last_updated = (known after apply)
      + name         = "test-workspace-tf"
      + org_id       = (known after apply)
      + visibility   = "PRIVATE"
    }

  # module.aws_batch.seqera_action.my_action will be created
  + resource "seqera_action" "my_action" {
      + action_id    = (known after apply)
      + config       = (known after apply)
      + hook_id      = (known after apply)
      + hook_url     = (known after apply)
      + id           = (known after apply)
      + launch       = {
          + compute_env_id       = (known after apply)
          + config_profiles      = []
          + config_text          = ""
          + entry_name           = (known after apply)
          + head_job_cpus        = (known after apply)
          + head_job_memory_mb   = (known after apply)
          + id                   = (known after apply)
          + launch_container     = (known after apply)
          + main_script          = (known after apply)
          + optimization_id      = (known after apply)
          + optimization_targets = (known after apply)
          + params_text          = (known after apply)
          + pipeline             = "https://github.com/nf-core/sarek"
          + post_run_script      = <<-EOT
                #!/bin/bash
                echo "Workflow execution completed!"
                # Add any cleanup commands here
            EOT
          + pre_run_script       = <<-EOT
                #!/bin/bash
                echo "Starting workflow execution..."
                # Add any setup commands here
            EOT
          + pull_latest          = true
          + resume               = true
          + resume_launch_id     = (known after apply)
          + revision             = "master"
          + run_name             = (known after apply)
          + schema_name          = (known after apply)
          + session_id           = (known after apply)
          + stub_run             = (known after apply)
          + tower_config         = (known after apply)
          + user_secrets         = (known after apply)
          + work_dir             = "s3://shahbaz-test"
          + workspace_id         = (known after apply)
          + workspace_secrets    = (known after apply)
        }
      + message      = (known after apply)
      + name         = "terraform-hello-world-action"
      + source       = "tower"
      + status       = (known after apply)
      + workspace_id = (known after apply)
    }

  # module.aws_batch.seqera_aws_compute_env.aws_batch_compute_env_dedicated will be created
  + resource "seqera_aws_compute_env" "aws_batch_compute_env_dedicated" {
      + compute_env_id = (known after apply)
      + config         = {
          + cli_path             = (known after apply)
          + compute_job_role     = (known after apply)
          + compute_queue        = (known after apply)
          + dragen_instance_type = (known after apply)
          + dragen_queue         = (known after apply)
          + enable_fusion        = (known after apply)
          + enable_wave          = (known after apply)
          + environment          = (known after apply)
          + execution_role       = (known after apply)
          + forge                = {
              + alloc_strategy       = "BEST_FIT_PROGRESSIVE"
              + allow_buckets        = (known after apply)
              + arm64_enabled        = false
              + bid_percentage       = (known after apply)
              + dispose_on_deletion  = true
              + dragen_ami_id        = (known after apply)
              + dragen_enabled       = (known after apply)
              + dragen_instance_type = (known after apply)
              + ebs_auto_scale       = false
              + ebs_block_size       = (known after apply)
              + ebs_boot_size        = (known after apply)
              + ec2_key_pair         = (known after apply)
              + ecs_config           = (known after apply)
              + efs_create           = (known after apply)
              + efs_id               = (known after apply)
              + efs_mount            = (known after apply)
              + fargate_head_enabled = (known after apply)
              + fsx_mount            = (known after apply)
              + fsx_name             = (known after apply)
              + fsx_size             = (known after apply)
              + gpu_enabled          = false
              + image_id             = (known after apply)
              + instance_types       = [
                  + "m5.large",
                  + "m5.xlarge",
                  + "m5.2xlarge",
                ]
              + max_cpus             = 1000
              + min_cpus             = 0
              + security_groups      = (known after apply)
              + subnets              = (known after apply)
              + type                 = "EC2"
              + vpc_id               = (known after apply)
            }
          + fusion_snapshots     = (known after apply)
          + head_job_cpus        = 2
          + head_job_memory_mb   = 4096
          + head_job_role        = (known after apply)
          + head_queue           = (known after apply)
          + log_group            = (known after apply)
          + lustre_id            = (known after apply)
          + nextflow_config      = (known after apply)
          + nvme_storage_enabled = (known after apply)
          + post_run_script      = (known after apply)
          + pre_run_script       = (known after apply)
          + region               = "us-east-1"
          + storage_type         = (known after apply)
          + volumes              = (known after apply)
          + work_dir             = "s3://shahbaz-test"
        }
      + credentials_id = (known after apply)
      + date_created   = (known after apply)
      + deleted        = (known after apply)
      + id             = (known after apply)
      + last_updated   = (known after apply)
      + last_used      = (known after apply)
      + name           = "aws-batch-dedicated"
      + org_id         = (known after apply)
      + platform       = "aws-batch"
      + status         = (known after apply)
      + workspace_id   = (known after apply)
    }

  # module.aws_batch.seqera_aws_credential.aws_credential will be created
  + resource "seqera_aws_credential" "aws_credential" {
      + access_key      = (sensitive value)
      + assume_role_arn = "arn:aws:iam::128997144437:role/TowerDevelopmentRole"
      + credentials_id  = (known after apply)
      + id              = (known after apply)
      + name            = "test_aws_credential"
      + provider_type   = "aws"
      + secret_key      = (sensitive value)
      + workspace_id    = (known after apply)
    }

  # module.aws_batch.seqera_compute_env.aws_batch_compute_env will be created
  + resource "seqera_compute_env" "aws_batch_compute_env" {
      + compute_env    = {
          + compute_env_id      = (known after apply)
          + config              = {
              + aws_batch = {
                  + cli_path             = (known after apply)
                  + compute_job_role     = (known after apply)
                  + compute_queue        = (known after apply)
                  + dragen_instance_type = (known after apply)
                  + dragen_queue         = (known after apply)
                  + enable_fusion        = (known after apply)
                  + enable_wave          = (known after apply)
                  + environment          = (known after apply)
                  + execution_role       = (known after apply)
                  + forge                = {
                      + alloc_strategy       = "BEST_FIT_PROGRESSIVE"
                      + allow_buckets        = (known after apply)
                      + arm64_enabled        = false
                      + bid_percentage       = (known after apply)
                      + dispose_on_deletion  = true
                      + dragen_ami_id        = (known after apply)
                      + dragen_enabled       = (known after apply)
                      + dragen_instance_type = (known after apply)
                      + ebs_auto_scale       = false
                      + ebs_block_size       = (known after apply)
                      + ebs_boot_size        = (known after apply)
                      + ec2_key_pair         = (known after apply)
                      + ecs_config           = (known after apply)
                      + efs_create           = (known after apply)
                      + efs_id               = (known after apply)
                      + efs_mount            = (known after apply)
                      + fargate_head_enabled = (known after apply)
                      + fsx_mount            = (known after apply)
                      + fsx_name             = (known after apply)
                      + fsx_size             = (known after apply)
                      + gpu_enabled          = false
                      + image_id             = (known after apply)
                      + instance_types       = [
                          + "m5.large",
                          + "m5.xlarge",
                          + "m5.2xlarge",
                        ]
                      + max_cpus             = 1000
                      + min_cpus             = 0
                      + security_groups      = (known after apply)
                      + subnets              = (known after apply)
                      + type                 = "EC2"
                      + vpc_id               = (known after apply)
                    }
                  + fusion_snapshots     = (known after apply)
                  + head_job_cpus        = 2
                  + head_job_memory_mb   = 4096
                  + head_job_role        = (known after apply)
                  + head_queue           = (known after apply)
                  + log_group            = (known after apply)
                  + lustre_id            = (known after apply)
                  + nextflow_config      = (known after apply)
                  + nvme_storage_enabled = (known after apply)
                  + post_run_script      = <<-EOT
                        #!/bin/bash
                        echo "Workflow execution completed!"
                        # Add any cleanup commands here
                    EOT
                  + pre_run_script       = <<-EOT
                        #!/bin/bash
                        echo "Starting workflow execution..."
                        # Add any setup commands here
                    EOT
                  + region               = "us-east-1"
                  + storage_type         = (known after apply)
                  + volumes              = (known after apply)
                  + work_dir             = "s3://shahbaz-test"
                }
            }
          + credentials_id      = (known after apply)
          + date_created        = (known after apply)
          + deleted             = (known after apply)
          + description         = "AWS Batch compute environment for bioinformatics workflows"
          + labels              = (known after apply)
          + last_updated        = (known after apply)
          + last_used           = (known after apply)
          + managed_identity_id = (known after apply)
          + message             = (known after apply)
          + name                = "aws-batch-compute-env"
          + org_id              = (known after apply)
          + platform            = "aws-batch"
          + primary             = (known after apply)
          + resources           = (known after apply)
          + status              = (known after apply)
          + workspace_id        = (known after apply)
        }
      + compute_env_id = (known after apply)
      + workspace_id   = (known after apply)
    }

  # module.aws_batch.seqera_data_link.my_datalink will be created
  + resource "seqera_data_link" "my_datalink" {
      + credentials       = (known after apply)
      + credentials_id    = (known after apply)
      + data_link_id      = (known after apply)
      + description       = "data link created by Terraform"
      + hidden            = (known after apply)
      + message           = (known after apply)
      + name              = "terraform-datalink"
      + provider_type     = "aws"
      + public_accessible = false
      + region            = (known after apply)
      + resource_ref      = "s3://shahbaz-test"
      + status            = (known after apply)
      + type              = "bucket"
      + workspace_id      = (known after apply)
    }

  # module.aws_batch.seqera_datasets.my_datasets will be created
  + resource "seqera_datasets" "my_datasets" {
      + description  = "Terraform created dataset"
      + id           = (known after apply)
      + last_updated = (known after apply)
      + media_type   = (known after apply)
      + name         = "terraform-dataset"
      + workspace_id = (known after apply)
    }

  # module.aws_batch.seqera_labels.my_labels will be created
  + resource "seqera_labels" "my_labels" {
      + is_default   = false
      + label_id     = (known after apply)
      + name         = "terraform-test-label"
      + resource     = true
      + value        = "terraform-label-value"
      + workspace_id = (known after apply)
    }

  # module.aws_batch.seqera_pipeline.hello_world_minimal will be created
  + resource "seqera_pipeline" "hello_world_minimal" {
      + description     = "Hello world pipeline generated by terraform"
      + icon            = (known after apply)
      + launch          = {
          + compute_env_id  = (known after apply)
          + config_profiles = []
          + head_job_cpus   = 6
          + pipeline        = "https://github.com/nextflow-io/hello"
          + pull_latest     = true
          + resume          = false
          + revision        = "master"
          + work_dir        = "s3://shahbaz-test"
        }
      + name            = "terraform-hello-world"
      + pipeline_id     = (known after apply)
      + repository      = (known after apply)
      + user_first_name = (known after apply)
      + user_id         = (known after apply)
      + user_name       = (known after apply)
      + workspace_id    = (known after apply)
    }

  # module.aws_batch.seqera_pipeline_secret.my_pipelinesecret will be created
  + resource "seqera_pipeline_secret" "my_pipelinesecret" {
      + date_created = (known after apply)
      + id           = (known after apply)
      + last_updated = (known after apply)
      + last_used    = (known after apply)
      + name         = "test_terraform_secret"
      + secret_id    = (known after apply)
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # module.aws_batch.seqera_primary_compute_env.my_primarycomputeenv will be created
  + resource "seqera_primary_compute_env" "my_primarycomputeenv" {
      + compute_env_id = (known after apply)
      + workspace_id   = (known after apply)
    }

  # module.aws_batch.seqera_studios.my_datastudios will be created
  + resource "seqera_studios" "my_datastudios" {
      + compute_env_id       = (known after apply)
      + configuration        = {
          + conda_environment = (known after apply)
          + cpu               = 2
          + environment       = (known after apply)
          + gpu               = 0
          + lifespan_hours    = (known after apply)
          + memory            = 8192
          + mount_data        = (known after apply)
        }
      + data_studio_tool_url = "public.cr.seqera.io/platform/data-studio-jupyter:4.2.5-0.8"
      + description          = "Data studio"
      + is_private           = (known after apply)
      + name                 = "Terraform-Data-Studio"
      + session_id           = (known after apply)
      + workspace_id         = (known after apply)
    }

  # module.aws_batch.seqera_workflows.my_workflows will be created
  + resource "seqera_workflows" "my_workflows" {
      + compute_env_id = (known after apply)
      + pipeline       = "nextflow-io/hello"
      + work_dir       = "s3://shahbaz-test"
      + workflow       = (known after apply)
      + workflow_id    = (known after apply)
      + workspace_id   = (known after apply)
    }

  # module.azure_batch.seqera_azure_credential.azure_credential will be created
  + resource "seqera_azure_credential" "azure_credential" {
      + batch_key      = (sensitive value)
      + batch_name     = "seqeralabs"
      + credentials_id = (known after apply)
      + id             = (known after apply)
      + name           = "azure_credential"
      + provider_type  = "azure"
      + storage_key    = (sensitive value)
      + storage_name   = "seqeralabs"
      + workspace_id   = (known after apply)
    }

  # module.azure_batch.seqera_compute_env.azure_batch_compute_env will be created
  + resource "seqera_compute_env" "azure_batch_compute_env" {
      + compute_env    = {
          + compute_env_id      = (known after apply)
          + config              = {
              + azure_batch = {
                  + auto_pool_mode             = (known after apply)
                  + delete_jobs_on_completion  = (known after apply)
                  + delete_pools_on_completion = (known after apply)
                  + enable_fusion              = (known after apply)
                  + enable_wave                = (known after apply)
                  + environment                = (known after apply)
                  + forge                      = {
                      + auto_scale          = (known after apply)
                      + container_reg_ids   = (known after apply)
                      + dispose_on_deletion = (known after apply)
                      + vm_count            = 1
                      + vm_type             = (known after apply)
                    }
                  + head_pool                  = (known after apply)
                  + managed_identity_client_id = (known after apply)
                  + nextflow_config            = (known after apply)
                  + post_run_script            = (known after apply)
                  + pre_run_script             = (known after apply)
                  + region                     = "eastus"
                  + token_duration             = (known after apply)
                  + work_dir                   = "az://terraform-provider"
                }
            }
          + credentials_id      = (known after apply)
          + date_created        = (known after apply)
          + deleted             = (known after apply)
          + description         = "azure Batch compute environment"
          + labels              = (known after apply)
          + last_updated        = (known after apply)
          + last_used           = (known after apply)
          + managed_identity_id = (known after apply)
          + message             = (known after apply)
          + name                = "azure-batch-compute-env-terraform"
          + org_id              = (known after apply)
          + platform            = "azure-batch"
          + primary             = (known after apply)
          + resources           = (known after apply)
          + status              = (known after apply)
          + workspace_id        = (known after apply)
        }
      + compute_env_id = (known after apply)
      + workspace_id   = (known after apply)
    }

  # module.azure_batch.seqera_pipeline.hello_world_minimal will be created
  + resource "seqera_pipeline" "hello_world_minimal" {
      + description     = "Hello world pipeline generated by terraform"
      + icon            = (known after apply)
      + launch          = {
          + compute_env_id  = (known after apply)
          + config_profiles = []
          + head_job_cpus   = 6
          + pipeline        = "https://github.com/nextflow-io/hello"
          + pull_latest     = true
          + resume          = false
          + revision        = "master"
          + work_dir        = "az://terraform-provider"
        }
      + name            = "terraform-hello-world-azure"
      + pipeline_id     = (known after apply)
      + repository      = (known after apply)
      + user_first_name = (known after apply)
      + user_id         = (known after apply)
      + user_name       = (known after apply)
      + workspace_id    = (known after apply)
    }

  # module.azure_batch.seqera_workflows.my_workflows will be created
  + resource "seqera_workflows" "my_workflows" {
      + compute_env_id = (known after apply)
      + pipeline       = "nextflow-io/hello"
      + work_dir       = "az://terraform-provider"
      + workflow       = (known after apply)
      + workflow_id    = (known after apply)
      + workspace_id   = (known after apply)
    }

Plan: 19 to add, 0 to change, 0 to destroy.
```

</details>

Plan generated at: Fri Jan 30 15:31:50 UTC 2026
